// Задача 1: Дана сторона квадрата a. Найти его периметр P=4*a

/*
const a = 4;
const p = 4*a;
console.log(p);
*/

/********************************************************************************************************************/

// Задача 2: Дана сторона квадрата a. Найти его площадь S=a^2

/*
const a = 7;
const s = a*a;
const d = Math.pow(a, 2);
const f = a ** 2;
console.log(f);
*/

/********************************************************************************************************************/

// Задача 3: Дано расстояние L в сантиметрах. Используя операцию деления нацело, найти количество полных метров в нем (1 метр = 100 см)

/********************************************************************************************************************/

/*
const l = 375;
const m = Math.floor(l/100); // в меньшую сторону
const n = Math.ceil(l/100); // в большую сторону
const r = Math.round(l/100); // математическое округление
const f = (l/100).toFixed(0); // округление до указанного числа в скобках
const i = parseInt(l/100); // приводит строку к числу
console.log(i);
*/

/********************************************************************************************************************/

